Catalogs/СотрудникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СотрудникиОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Comment>Структурная единица</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>киб_Вахтовик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СотрудникиОрганизаций/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область УправлениеДоступом

// СтандартныеПодсистемы.УправлениеДоступом

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЭтоГруппа Тогда
		
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.ЗначениеДоступа = Ссылка;
		
	Иначе
	                                                              
		Запрос = ЗапросВТВсеЗначенияДоступаСотрудников(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка));
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Выполнить();

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СтруктурноеПодразделение", СтруктурноеПодразделение);

		Если ДополнительныеСвойства.Свойство("ТекущаяОрганизация") 
			И ЗначениеЗаполнено(ДополнительныеСвойства.ТекущаяОрганизация) Тогда
			
			ТекущаяОрганизация = ДополнительныеСвойства.ТекущаяОрганизация;
			
		Иначе
			ТекущаяОрганизация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;

		Запрос.УстановитьПараметр("ТекущаяОрганизация", ТекущаяОрганизация);

		Если ДополнительныеСвойства.Свойство("ТекущееСтруктурноеПодразделение") 
			И ЗначениеЗаполнено(ДополнительныеСвойства.ТекущееСтруктурноеПодразделение) Тогда
			
			ТекущееСтруктурноеПодразделение = ДополнительныеСвойства.ТекущееСтруктурноеПодразделение;
			
		Иначе
			ТекущееСтруктурноеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		КонецЕсли;

		Запрос.УстановитьПараметр("ТекущееСтруктурноеПодразделение", ТекущееСтруктурноеПодразделение);

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеЗначенияДоступаСотрудников.ЗначениеДоступаОрганизация КАК ЗначениеДоступаОрганизация,
		|	ВсеЗначенияДоступаСотрудников.ЗначениеДоступаСП КАК ЗначениеДоступаСП
		|ПОМЕСТИТЬ ВТЗначенияДоступаСотрудника
		|ИЗ
		|	ВТВсеЗначенияДоступаСотрудников КАК ВсеЗначенияДоступаСотрудников
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Организация,
		|	&СтруктурноеПодразделение
		|ГДЕ
		|	&Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ТекущаяОрганизация,
		|	&ТекущееСтруктурноеПодразделение
		|ГДЕ
		|	&ТекущаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДоступаСотрудника.ЗначениеДоступаОрганизация,
		|	ЗначенияДоступаСотрудника.ЗначениеДоступаСП
		|ИЗ
		|	ВТЗначенияДоступаСотрудника КАК ЗначенияДоступаСотрудника";
			
		НомерНабора = 0;

		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
				
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтрокаТаб = Таблица.Добавить();
				СтрокаТаб.НомерНабора		= НомерНабора;
				СтрокаТаб.ЗначениеДоступа	= Выборка.ЗначениеДоступаОрганизация;
				
				СтрокаТаб = Таблица.Добавить();
				СтрокаТаб.НомерНабора		= НомерНабора;
				СтрокаТаб.ЗначениеДоступа	= Выборка.ЗначениеДоступаСП;
			
				СтрокаТаб = Таблица.Добавить();
				СтрокаТаб.НомерНабора		= НомерНабора;
				СтрокаТаб.ЗначениеДоступа	= Физлицо;
				
				НомерНабора = НомерНабора + 1;
				
			КонецЦикла;
				
		Иначе

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора		= НомерНабора;
			СтрокаТаб.ЗначениеДоступа	= Физлицо;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ЗапросВТВсеЗначенияДоступаСотрудников(Сотрудники)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.ЗначениеДоступаОрганизация,
	|	ВложенныйЗапрос.ЗначениеДоступаСП
	|ПОМЕСТИТЬ ВТВсеЗначенияДоступаСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		Сотрудники.Ссылка КАК Сотрудник,
	|		Сотрудники.Организация КАК ЗначениеДоступаОрганизация,
	|		Сотрудники.СтруктурноеПодразделение КАК ЗначениеДоступаСП
	|	ИЗ
	|		Справочник.СотрудникиОрганизаций КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.Ссылка В(&Сотрудники)
	|		И Сотрудники.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаботникиОрганизаций.Сотрудник,
	|		РаботникиОрганизаций.ОбособленноеПодразделение,
	|		РаботникиОрганизаций.СтруктурноеПодразделение
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ГДЕ
	|		РаботникиОрганизаций.Сотрудник В(&Сотрудники)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Сотрудники.Ссылка,
	|		Сотрудники.ТекущаяСтруктурнаяЕдиница,
	|		Сотрудники.ТекущееСтруктурноеПодразделение
	|	ИЗ
	|		Справочник.СотрудникиОрганизаций КАК Сотрудники
	|	ГДЕ
	|		Сотрудники.Ссылка В(&Сотрудники)
	|		И Сотрудники.ТекущаяСтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЗначениеДоступаСП,
	|	ВложенныйЗапрос.ЗначениеДоступаОрганизация,
	|	ВложенныйЗапрос.Сотрудник";
	
	Возврат Запрос;

КонецФункции	

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоОснованию(ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа И СтруктурнаяЕдиница.Пустая() Тогда
		СтруктурнаяЕдиница = Организация;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(ДатаПриемаНаРаботу) И ТекущаяСтруктурнаяЕдиница <> СтруктурнаяЕдиница Тогда
		ТекущаяСтруктурнаяЕдиница = СтруктурнаяЕдиница;
	КонецЕсли;
	    	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей") 
		и ЭтоНовый() Тогда
		
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияГруппДоступаПоУмолчанию.ВсеРазрешеныБезИсключений КАК ВсеРазрешеныБезИсключений
		|ИЗ
		|	РегистрСведений.ЗначенияГруппДоступаПоУмолчанию КАК ЗначенияГруппДоступаПоУмолчанию
		|ГДЕ
		|	ЗначенияГруппДоступаПоУмолчанию.ГруппаДоступа.Пользователь = &Пользователь
		|	И ЗначенияГруппДоступаПоУмолчанию.ТипЗначенийДоступа = &ТипЗначенийДоступа";
		
		Запрос.УстановитьПараметр("Пользователь"		, Пользователи.ТекущийПользователь());
		Запрос.УстановитьПараметр("ТипЗначенийДоступа"	, Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Для пользователя не получилось определить правдо доступа к справочнику ""Подразделения организаций""!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"СтруктурноеПодразделениеОрганизация",,Отказ);
		Иначе 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ВсеРазрешеныБезИсключений Тогда 
				Возврат;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено (СтруктурноеПодразделение) Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияГруппДоступа.ЗначениеРазрешено КАК ЗначениеРазрешено
			|ИЗ
			|	РегистрСведений.ЗначенияГруппДоступа КАК ЗначенияГруппДоступа
			|ГДЕ
			|	ЗначенияГруппДоступа.ГруппаДоступа.Пользователь = &Пользователь
			|	И ЗначенияГруппДоступа.ЗначениеДоступа = &Подразделение
			|	И ЗначенияГруппДоступа.ЗначениеРазрешено";
			
			Запрос.УстановитьПараметр("Подразделение", СтруктурноеПодразделение);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недостаточно прав доступа, на структурное подразделение: ""%1""!'")
				, ?(ЗначениеЗаполнено(СтруктурноеПодразделение), СтруктурноеПодразделение, "головное подразделение")); 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"СтруктурноеПодразделениеОрганизация",,Отказ);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьПоОснованию(Основание) Экспорт

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Физлицо = Основание;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
